{
  "architectures": [
    "AutoModel"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_ids": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "VENDOR",
    "2": "DATE",
    "3": "HCW",
    "4": "HOSPITAL",
    "5": "ID",
    "6": "PATIENT",
    "7": "PHONE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "DATE": 2,
    "HCW": 3,
    "HOSPITAL": 4,
    "ID": 5,
    "O": 0,
    "PATIENT": 6,
    "PHONE": 7,
    "VENDOR": 1
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.6",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
