{
  "_attn_implementation_autoset": true,
  "_name_or_path": "Ar86Bat/multilang-pii-ner",
  "architectures": [
    "XLMRobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-AGE",
    "1": "B-BUILDINGNUM",
    "2": "B-CITY",
    "3": "B-CREDITCARDNUMBER",
    "4": "B-DATE",
    "5": "B-DRIVERLICENSENUM",
    "6": "B-EMAIL",
    "7": "B-GENDER",
    "8": "B-GIVENNAME",
    "9": "B-IDCARDNUM",
    "10": "B-PASSPORTNUM",
    "11": "B-SEX",
    "12": "B-SOCIALNUM",
    "13": "B-STREET",
    "14": "B-SURNAME",
    "15": "B-TAXNUM",
    "16": "B-TELEPHONENUM",
    "17": "B-TIME",
    "18": "B-TITLE",
    "19": "B-ZIPCODE",
    "20": "I-BUILDINGNUM",
    "21": "I-CITY",
    "22": "I-DATE",
    "23": "I-DRIVERLICENSENUM",
    "24": "I-EMAIL",
    "25": "I-GIVENNAME",
    "26": "I-SOCIALNUM",
    "27": "I-STREET",
    "28": "I-SURNAME",
    "29": "I-TAXNUM",
    "30": "I-TELEPHONENUM",
    "31": "I-TIME",
    "32": "I-TITLE",
    "33": "I-ZIPCODE",
    "34": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-AGE": 0,
    "B-BUILDINGNUM": 1,
    "B-CITY": 2,
    "B-CREDITCARDNUMBER": 3,
    "B-DATE": 4,
    "B-DRIVERLICENSENUM": 5,
    "B-EMAIL": 6,
    "B-GENDER": 7,
    "B-GIVENNAME": 8,
    "B-IDCARDNUM": 9,
    "B-PASSPORTNUM": 10,
    "B-SEX": 11,
    "B-SOCIALNUM": 12,
    "B-STREET": 13,
    "B-SURNAME": 14,
    "B-TAXNUM": 15,
    "B-TELEPHONENUM": 16,
    "B-TIME": 17,
    "B-TITLE": 18,
    "B-ZIPCODE": 19,
    "I-BUILDINGNUM": 20,
    "I-CITY": 21,
    "I-DATE": 22,
    "I-DRIVERLICENSENUM": 23,
    "I-EMAIL": 24,
    "I-GIVENNAME": 25,
    "I-SOCIALNUM": 26,
    "I-STREET": 27,
    "I-SURNAME": 28,
    "I-TAXNUM": 29,
    "I-TELEPHONENUM": 30,
    "I-TIME": 31,
    "I-TITLE": 32,
    "I-ZIPCODE": 33,
    "O": 34
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
